// рекурсивна функція  - функція, яка в процесі свого виконання може викликати саму себе

// ПОГАНА РЕКУРСИВНА ФУНКЦІЯ
// function sum(num1 = 2, num2 = 2) {
//   alert()

//   console.log(num1 + num2)
// }

// sum();
// for(let i = 10; i >= 0; i--) {
//   console.log(i)
// }

function countdown(number) {
  console.log(number)

  // Рекурсивний випадок
  if(number > 0) {
    countdown(number - 1);
  }

  // базовий випадок
  return undefined;
}

/* 
  Етапи роботи рекурсивної функції
  1. Функція рекурсивно робить якусь дію та запускає саму себе в колл стаці
  2. якась з запусків функцій доходить до базового випадку (не запускає іншу функцію до свого завершення)
  3. всі інші функції завершують свою роботу.
*/